app/controllers/strains_controller.rb

SELECT "strains".* FROM "strains"
---
  def index
      @strains = Strain.all

SELECT  "strains".* FROM "strains" WHERE "strains"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def show
    @strain = Strain.find params[:id]